
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверкаКатегорииСотрудника();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияСотрудникаПриИзменении(Элемент)
	
	ПроверкаКатегорииСотрудника();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверкаКатегорииСотрудника()
	
	Если Запись.КатегорияСотрудника <> Перечисления.ВКМ_КатегорииСотрудников.Специалисты Тогда
		Элементы.ПроцентОтРабот.Доступность = Ложь;
		Запись.ПроцентОтРабот = 0;
	Иначе
		Элементы.ПроцентОтРабот.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти