
#Область ПрограммныйИнтерфейс

// Возвращает строку JSON
//
// Параметры:
//  ОбъектJSON - ЧтениеJSON - Объект JSON
//
// Возвращаемое значение:
//	ЗаписьJSON
Функция СтрокаJSON(ОбъектJSON) Экспорт

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	

КонецФункции // СтрокаJSON()

// Возвращает Объект JSON
//
// Параметры:
//  СтрокаJSON - ЗаписьJSON - Запись JSON
//
// Возвращаемое значение:
//	ЧтениеJSON
Функция ОбъектJSON(СтрокаJSON) Экспорт

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат ОбъектJSON;

КонецФункции // СтрокаJSON()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипКонтентаJSON() Экспорт
	
	Возврат "application/json";
	
КонецФункции

#КонецОбласти