
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеГрафикаСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковСрезПоследних.Сотрудник,
	|	СУММА(ВКМ_ГрафикОтпусковСрезПоследних.КоличествоДней) КАК КоличествоДней
	|ИЗ
	|	РегистрСведений.ВКМ_ГрафикОтпусков.СрезПоследних КАК ВКМ_ГрафикОтпусковСрезПоследних
	|ГДЕ
	|	ВКМ_ГрафикОтпусковСрезПоследних.Сотрудник В (&Сотрудник)
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли