
#Область  ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьКоличествоДней();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	РассчитатьКоличествоДней();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресХранилища = ПоместитьГрафикВХранилище();
	ПараметрыФормы = Новый Структура("АдресГрафика", АдресХранилища);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика"
			, ПараметрыФормы
			, ЭтотОбъект
			, Новый УникальныйИдентификатор());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьКоличествоДней()
	
	Если ТекущийЭлемент.ТекущиеДанные.ДатаОкончания > КонецГода(Объект.Год) Тогда
		ТекущийЭлемент.ТекущиеДанные.ДатаОкончания = КонецГода(Объект.Год);
			
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата окончания отпуска указана за пределами указанного в документе года";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ТекущийЭлемент.ТекущиеДанные.ДатаНачала < НачалоГода(Объект.Год) Тогда
		ТекущийЭлемент.ТекущиеДанные.ДатаНачала	= НачалоГода(Объект.Год);
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата начала отпуска указана за пределами указанного в документе года";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Месяц(ТекущийЭлемент.ТекущиеДанные.ДатаНачала) <> Месяц(ТекущийЭлемент.ТекущиеДанные.ДатаОкончания) Тогда
		ТекущийЭлемент.ТекущиеДанные.ДатаНачала	= Дата(1, 1, 1);
		ТекущийЭлемент.ТекущиеДанные.ДатаОкончания = Дата(1, 1, 1);
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Неверно указан диапазон дат отпуска. Дни отпуска по разным месяцам следует разбить по разным строкам";
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущийЭлемент.ТекущиеДанные.КоличествоДней = Число(ТекущийЭлемент.ТекущиеДанные.ДатаОкончания - ТекущийЭлемент.ТекущиеДанные.ДатаНачала) / (60 * 60 * 24);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьГрафикВХранилище()
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
	
	Возврат АдресХранилища;
	
КонецФункции
	
#КонецОбласти