
#Область  ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьКоличествоДней();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	РассчитатьКоличествоДней();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресХранилища = ПоместитьГрафикВХранилище();
	ПараметрыФормы = Новый Структура("АдресГрафика", АдресХранилища);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика"
			, ПараметрыФормы
			, ЭтотОбъект
			, Новый УникальныйИдентификатор());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьКоличествоДней()
	
	Если ТекущийЭлемент.ТекущиеДанные.ДатаОкончания > КонецГода(Объект.Год) Тогда
		ТекущийЭлемент.ТекущиеДанные.ДатаОкончания = КонецГода(Объект.Год);	
	ИначеЕсли ТекущийЭлемент.ТекущиеДанные.ДатаНачала < НачалоГода(Объект.Год) Тогда
		ТекущийЭлемент.ТекущиеДанные.ДатаНачала	= НачалоГода(Объект.Год)
	Иначе
		ТекущееКоличествоДней = РассчитатьКоличествоДнейСервер(ТекущийЭлемент.ТекущиеДанные.Сотрудник);
		КоличествоДней = Число(ТекущийЭлемент.ТекущиеДанные.ДатаОкончания - ТекущийЭлемент.ТекущиеДанные.ДатаНачала) / (60 * 60 * 24);
		ТекущийЭлемент.ТекущиеДанные.КоличествоДней = ТекущееКоличествоДней + КоличествоДней;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьКоличествоДнейСервер(Сотрудник)

	Результат = РегистрыСведений.ВКМ_ГрафикОтпусков.ПолучитьДанныеГрафикаСотрудника(Сотрудник);
	
	КоличествоДней = 0;
	Если Результат <> Неопределено Тогда
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			КоличествоДней = КоличествоДней + Выборка.КоличествоДней;
		КонецЦикла;		
	КонецЕсли;
	
	Возврат КоличествоДней;
	
КонецФункции

&НаСервере
Функция ПоместитьГрафикВХранилище()
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
	
	Возврат АдресХранилища;
	
КонецФункции
	
#КонецОбласти